; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v4 ?v2)
             (pred_8 ?v1 ?v6)
             (pred_12 ?v4 ?v6)
             (pred_10 ?v10 ?v4 )
	     (pred_2 ?v4)
             (pred_6 ?v8)
             (pred_11 ?v1)
             (pred_7 ?v6)
             (pred_1 ?v4)
             (pred_4 ?v1)
             (pred_5 ?v4)
             (pred_9 ))



(:action op_5
:parameters (?v13 ?v11 ?v7 ?v3)
:precondition (and (pred_6 ?v13) (pred_6 ?v11) (pred_11 ?v7) (pred_7 ?v3)
          (pred_3 ?v13 ?v11) (pred_8 ?v7 ?v3)
                   (pred_12 ?v11 ?v3) (pred_2 ?v13) 
                   (pred_1 ?v11) (pred_4 ?v7))
:effect (and  (pred_5 ?v11) (not (pred_1 ?v11))))


(:action op_4
:parameters (?v13 ?v9)
:precondition (and (pred_6 ?v13) (pred_6 ?v9)
               (pred_2 ?v13) (pred_3 ?v13 ?v9) (pred_5 ?v9))
:effect (and (pred_2 ?v9) (not (pred_2 ?v13))))

(:action op_1
:parameters (?v13 ?v7)
:precondition (and (pred_6 ?v13) (pred_11 ?v7) 
                  (pred_2 ?v13) (pred_10 ?v7 ?v13) (pred_9 ))
:effect (and (pred_4 ?v7)
   (not (pred_10 ?v7 ?v13)) (not (pred_9 ))))


(:action op_3
:parameters (?v13 ?v12 ?v5)
:precondition (and (pred_6 ?v13) (pred_11 ?v12) (pred_11 ?v5)
                  (pred_2 ?v13) (pred_4 ?v5) (pred_10 ?v12 ?v13))
:effect (and (pred_4 ?v12) (pred_10 ?v5 ?v13)
        (not (pred_4 ?v5)) (not (pred_10 ?v12 ?v13))))

(:action op_2
:parameters (?v13 ?v7)
:precondition (and (pred_6 ?v13) (pred_11 ?v7) 
                  (pred_2 ?v13) (pred_4 ?v7))
:effect (and (pred_9 ) (pred_10 ?v7 ?v13) (not (pred_4 ?v7)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_10 obj_02 obj_04 obj_11 obj_19 obj_03 obj_06 obj_01 obj_20 obj_16 obj_07 obj_13 obj_18 obj_17 obj_15 obj_12
    obj_14 obj_21
    obj_09 obj_08 obj_05
    )

    (:init
       (pred_9)

       (pred_6 obj_10)
       (pred_6 obj_02)
       (pred_6 obj_04)
       (pred_6 obj_11)
       (pred_6 obj_19)
       (pred_6 obj_03)
       (pred_6 obj_06)
       (pred_6 obj_01)
       (pred_6 obj_20)
       (pred_6 obj_16)
       (pred_6 obj_07)
       (pred_6 obj_13)
       (pred_6 obj_18)
       (pred_6 obj_17)
       (pred_6 obj_15)
       (pred_6 obj_12)
       (pred_7 obj_14)
       (pred_7 obj_21)
       (pred_11 obj_09)
       (pred_11 obj_08)
       (pred_11 obj_05)

       (pred_3 obj_10 obj_19)
       (pred_3 obj_10 obj_02)
       (pred_3 obj_02 obj_03)
       (pred_3 obj_02 obj_04)
       (pred_3 obj_02 obj_10)
       (pred_3 obj_04 obj_06)
       (pred_3 obj_04 obj_11)
       (pred_3 obj_04 obj_02)
       (pred_3 obj_11 obj_01)
       (pred_3 obj_11 obj_04)
       (pred_3 obj_19 obj_20)
       (pred_3 obj_19 obj_03)
       (pred_3 obj_19 obj_10)
       (pred_3 obj_03 obj_16)
       (pred_3 obj_03 obj_06)
       (pred_3 obj_03 obj_02)
       (pred_3 obj_03 obj_19)
       (pred_3 obj_06 obj_07)
       (pred_3 obj_06 obj_01)
       (pred_3 obj_06 obj_04)
       (pred_3 obj_06 obj_03)
       (pred_3 obj_01 obj_13)
       (pred_3 obj_01 obj_11)
       (pred_3 obj_01 obj_06)
       (pred_3 obj_20 obj_18)
       (pred_3 obj_20 obj_16)
       (pred_3 obj_20 obj_19)
       (pred_3 obj_16 obj_17)
       (pred_3 obj_16 obj_07)
       (pred_3 obj_16 obj_03)
       (pred_3 obj_16 obj_20)
       (pred_3 obj_07 obj_15)
       (pred_3 obj_07 obj_13)
       (pred_3 obj_07 obj_06)
       (pred_3 obj_07 obj_16)
       (pred_3 obj_13 obj_12)
       (pred_3 obj_13 obj_01)
       (pred_3 obj_13 obj_07)
       (pred_3 obj_18 obj_17)
       (pred_3 obj_18 obj_20)
       (pred_3 obj_17 obj_15)
       (pred_3 obj_17 obj_16)
       (pred_3 obj_17 obj_18)
       (pred_3 obj_15 obj_12)
       (pred_3 obj_15 obj_07)
       (pred_3 obj_15 obj_17)
       (pred_3 obj_12 obj_13)
       (pred_3 obj_12 obj_15)
       (pred_1 obj_19)
       (pred_1 obj_13)
       (pred_1 obj_06)
       (pred_12  obj_19 obj_14)
       (pred_12  obj_13 obj_21)
       (pred_12  obj_06 obj_21)
       (pred_5 obj_10)
       (pred_5 obj_02)
       (pred_5 obj_04)
       (pred_5 obj_11)
       (pred_5 obj_03)
       (pred_5 obj_01)
       (pred_5 obj_20)
       (pred_5 obj_16)
       (pred_5 obj_07)
       (pred_5 obj_18)
       (pred_5 obj_17)
       (pred_5 obj_15)
       (pred_5 obj_12)

       (pred_8  obj_09 obj_14)
       (pred_8  obj_08 obj_21)
       (pred_8  obj_05 obj_14)
       (pred_10 obj_09 obj_01)
       (pred_10 obj_08 obj_11)
       (pred_10 obj_05 obj_12)
       (pred_2 obj_10)
    )

    (:goal (and
       (pred_10 obj_09 obj_11)
       (pred_10 obj_05 obj_11)
    ))
(:constraints
  (always (not (pred_2 obj_13)))
)
)

; plan
1. (op_4 obj_10 obj_02)
   deleted: (pred_2 obj_10)
   added: (pred_2 obj_02)
   goals met: 0 of 2
2. (op_4 obj_02 obj_04)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_04)
   goals met: 0 of 2
3. (op_4 obj_04 obj_11)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_11)
   goals met: 0 of 2
4. (op_4 obj_11 obj_01)
   deleted: (pred_2 obj_11)
   added: (pred_2 obj_01)
   goals met: 0 of 2
5. (op_1 obj_01 obj_09)
   deleted: (pred_10 obj_09 obj_01) (pred_9)
   added: (pred_4 obj_09)
   goals met: 0 of 2
6. (op_4 obj_01 obj_11)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_11)
   goals met: 0 of 2
7. (op_3 obj_11 obj_08 obj_09)
   deleted: (pred_4 obj_09) (pred_10 obj_08 obj_11)
   added: (pred_4 obj_08) (pred_10 obj_09 obj_11)
   goals met: 1 of 2
8. (op_4 obj_11 obj_01)
   deleted: (pred_2 obj_11)
   added: (pred_2 obj_01)
   goals met: 1 of 2
9. (op_5 obj_01 obj_13 obj_08 obj_21)
   deleted: (pred_1 obj_13)
   added: (pred_5 obj_13)
   goals met: 1 of 2
10. (op_5 obj_01 obj_06 obj_08 obj_21)
   deleted: (pred_1 obj_06)
   added: (pred_5 obj_06)
   goals met: 1 of 2
11. (op_2 obj_01 obj_08)
   deleted: (pred_4 obj_08)
   added: (pred_9) (pred_10 obj_08 obj_01)
   goals met: 1 of 2
12. (op_4 obj_01 obj_06)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_06)
   goals met: 1 of 2
13. (op_4 obj_06 obj_07)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_07)
   goals met: 1 of 2
14. (op_4 obj_07 obj_15)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_15)
   goals met: 1 of 2
15. (op_4 obj_15 obj_12)
   deleted: (pred_2 obj_15)
   added: (pred_2 obj_12)
   goals met: 1 of 2
16. (op_1 obj_12 obj_05)
   deleted: (pred_10 obj_05 obj_12) (pred_9)
   added: (pred_4 obj_05)
   goals met: 1 of 2
17. (op_4 obj_12 obj_15)
   deleted: (pred_2 obj_12)
   added: (pred_2 obj_15)
   goals met: 1 of 2
18. (op_4 obj_15 obj_07)
   deleted: (pred_2 obj_15)
   added: (pred_2 obj_07)
   goals met: 1 of 2
19. (op_4 obj_07 obj_06)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_06)
   goals met: 1 of 2
20. (op_4 obj_06 obj_04)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_04)
   goals met: 1 of 2
21. (op_4 obj_04 obj_11)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_11)
   goals met: 1 of 2
22. (op_2 obj_11 obj_05)
   deleted: (pred_4 obj_05)
   added: (pred_9) (pred_10 obj_05 obj_11)
   goals met: 2 of 2
